const bank = {
    bachelor: {
        1: [
            { name: 'التحليل الآلي', number: 30206381, link: '' },
            { name: 'أجهزة ومعدات طبية', number: 30305361, link: '' },
            { name: 'الإحصاء الحيوي الطبي', number: 30202282, link: '' },
            { name: 'الاحصاء الحيوي', number: 30207282, link: '' },
            { name: 'الثقافة الإسلامية', number: 36005105, link: '' },
            { name: 'الرياضة والصحة للجميع', number: 36004104, link: '' },
            { name: 'الفيزياء العامة', number: 30201103, link: '' },
            { name: 'الفيزياء العامة عملي', number: 30201104, link: '' },
            { name: 'الكيمياء التحليلية', number: 30206241, link: '' },
            { name: 'الكيمياء العامة (1)', number: 30206101, link: '' },
            { name: 'الكيمياء العامة (2)', number: 30206103, link: '' },
            { name: 'الكيمياء العامة العملية', number: 30206105, link: '' },
            { name: 'الكيمياء العامة العملية (2)', number: 30206104, link: '' },
            { name: 'الكيمياء العضوية', number: 30206221, link: '' },
            { name: 'اللغة الانجليزية (1)', number: 35004101, link: '' },
            { name: 'اللغة الانجليزية (2)', number: 35004102, link: '' },
            { name: 'اللغة الانجليزية (99)', number: 301502099, link: '' },
            { name: 'اللغة العربية (1)', number: 35003101, link: '' },
            { name: 'اللغة العربية (2)', number: 35003102, link: '' },
            { name: 'اللغة العربية (99)', number: 301501199, link: '' },
            { name: 'تفاضل وتكامل 1', number: 30202101, link: '' },
            { name: 'علوم عسكرية', number: 35001101, link: '' }
        ],

        2: [
            { name: 'المجتمع الرقمي', number: 36009115, link: '' },
            { name: 'مهارات الحاسوب (1)', number: 35005101, link: '' },
            { name: 'مهارات الحاسوب الاستدراكي', number: 35005099, link: '' },
            { name: 'مهارات الحاسوب والتعليم الالكتروني', number: 'CS101', link: '' },
            { name: 'مهارات حاسوب (2) لطلبة الكليات العلمية', number: 30204102, link: '' }
        ],

        3: [
            { name: 'إدارة مؤسسات الغذاء والتغذية', number: 30402445, link: '' },
            { name: 'اساسيات هندسة الغذاء', number: 30402438, link: '' },
            { name: 'الأحياء الدقيقة للاغذية', number: 30402322, link: '' },
            { name: 'التدريب الميداني في التغذية والتصنيع الغذائي', number: 30402400, link: '' },
            { name: 'التغذية خلال مراحل الحياة', number: 30402455, link: '' },
            { name: 'التكنولوجيا الحيوية للاغذية', number: 30402425, link: '' },
            { name: 'الكيمياء الحيوية', number: 30206322, link: '' },
            { name: 'المعالجة بالغذاء', number: 30402352, link: '' },
            { name: 'الندوة /لطلبة التغذية والتصنيع الغذائي', number: 30402402, link: '' },
            { name: 'تحليل الأغذيه', number: 30402312, link: '' },
            { name: 'تقييم الوضع التغذوي', number: 30402351, link: '' },
            { name: 'تكنولوجيا الاغذية', number: 30402330, link: '' },
            { name: 'صحة وسلامة الاغذية', number: 30402324, link: '' },
            { name: 'ضبط جودة الأغذية', number: 30402424, link: '' },
            { name: 'علم الأحياء الدقيقه', number: 30402221, link: '' },
            { name: 'علم وتكنولوجيا الألبان', number: 30402333, link: '' },
            { name: 'فسيولوجيا الانسان', number: 'NFP261', link: '' },
            { name: 'فسيولوجيا الانسان', number: 30402251, link: '' },
            { name: 'كيمياء الأغذيه', number: 30402311, link: '' },
            { name: 'مبادئ الانتاج الحيواني', number: 30405252, link: '' },
            { name: 'مبادئ الانتاج النباتي', number: 30403211, link: '' },
            { name: 'مبادئ علم التغذية', number: 30402240, link: '' },
            { name: 'مبادئ علم الغذاء', number: 30402230, link: '' },
        ],

        4: [
            { name: 'احياء دقيقة طبية', number: 30305341, link: '' },
            { name: 'الأحياء الدقيقة التشخيصيه', number: 30305441, link: '' },
            { name: 'الأحياء الدقيقة التطبيقية الصناعية', number: 30205428, link: '' },
            { name: 'الأحياء الدقيقة في البيئة', number: 30205421, link: '' },
            { name: 'الأيض', number: 30203441, link: '' },
            { name: 'الاحياء الدقيقة العامة', number: 30305241, link: '' },
            { name: 'البيولوجيا الجزيئية', number: 30203352, link: '' },
            { name: 'التحضيرات المجهرية', number: 30305312, link: '' },
            { name: 'التدريب الميداني (1)', number: 30305470, link: '' },
            { name: 'التدريب الميداني (2)', number: 30305471, link: '' },
            { name: 'التدريب الميداني/ لطلبة العلوم الحياتية', number: 30203361, link: '' },
            { name: 'التدريب الميداني/لطلبة الأحياء الدقيقة التطبيقية', number: 30205361, link: '' },
            { name: 'التقنيات الحيوية', number: 30203453, link: '' },
            { name: 'الطفيليات الطبية', number: 30305445, link: '' },
            { name: 'العلوم الحياتية العامة (2)', number: 30203102, link: '' },
            { name: 'العلوم الحياتية العامة العملية', number: 30203114, link: '' },
            { name: 'الغدد الصماء', number: 30305322, link: '' },
            { name: 'الكيمياء الحيوية العامة', number: 30203304, link: '' },
            { name: 'الكيمياء الحيوية العامة عملي', number: 30203305, link: '' },
            { name: 'الكيمياء السريرية', number: 30305331, link: '' },
            { name: 'الكيمياء السريرية 1', number: 30205341, link: '' },
            { name: 'المضادات الحيوية', number: 30205425, link: '' },
            { name: 'بنك الدم', number: 30305453, link: '' },
            { name: 'بيولوجيا الخلية', number: 30203212, link: '' },
            { name: 'تشريح الانسان', number: 30305211, link: '' },
            { name: 'تشريح الفقاريات', number: 30203333, link: '' },
            { name: 'تصنيف النبات', number: 30203354, link: '' },
            { name: 'سوائل الجسم', number: 30305421, link: '' },
            { name: 'علم الدم', number: '30305453-', link: '' },
            { name: 'علم الأجنة', number: 30203313, link: '' },
            { name: 'علم الأنسجة والتحضيرات المجهرية', number: 30203311, link: '' },
            { name: 'علم الامراض', number: 30305313, link: '' },
            { name: 'علم الانسجة', number: 30305311, link: '' },
            { name: 'علم الحيوان العام', number: 30203231, link: '' },
            { name: 'علم الحيوان العام / عملي', number: 30203232, link: '' },
            { name: 'علم الدم (1)', number: 30305351, link: '' },
            { name: 'علم الدم (2)', number: 30305352, link: '' },
            { name: 'علم الطحالب', number: 30205331, link: '' },
            { name: 'علم الفطريات والفطريات الطبية', number: 30305423, link: '' },
            { name: 'علم الفيروسات والفيروسات الطبية', number: 30305427, link: '' },
            { name: 'علم المناعة والأمصال', number: 30305455, link: '' },
            { name: 'علم النبات العام', number: 30203251, link: '' },
            { name: 'علم النبات العام / عملي', number: 30203252, link: '' },
            { name: 'علم الوراثة', number: 30203345, link: '' },
            { name: 'علم وظائف الأعضاء', number: 30203331, link: '' },
            { name: 'فسيولوجيا النبات', number: '-30203352', link: '' },
            { name: 'ندوة - لطلبة التحاليل الطبية', number: 30305422, link: '' },
            { name: 'ندوة/لطلبة الأحياء الدقيقة التطبيقية', number: 30205461, link: '' },
            { name: 'ندوة/لطلبة العلوم الحياتية', number: 30203461, link: '' },
            { name: 'وراثة الأحياء الدقيقة', number: 30205211, link: '' }
        ]
    },
    
    diploma: {
        1: [

        ],

        2: [

        ],

        4: [

        ]
    }
}